Revit 2027 API
BuiltInFailures.StairRampFailures.RiserCurveTooShort Property
 Riser curve is too short to create nosing on it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RiserCurveTooShort { get; }
Public Shared ReadOnly Property RiserCurveTooShort As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RiserCurveTooShort {
	FailureDefinitionId^ get ();
}
static member RiserCurveTooShort : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace